MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA6M2AF3CFP/mcu.h
/** @} */ /* End of group Device_Peripheral_peripherals */

/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_peripheralAddr
 * @{
 */

 #define R_ACMPHS0_BASE         0x40085000UL
 #define R_ACMPHS1_BASE         0x40085100UL
 #define R_ACMPHS2_BASE         0x40085200UL
 #define R_ACMPHS3_BASE         0x40085300UL
 #define R_ACMPHS4_BASE         0x40085400UL
 #define R_ACMPHS5_BASE         0x40085500UL
 #define R_ADC0_BASE            0x4005C000UL
 #define R_ADC1_BASE            0x4005C200UL
 #define R_BUS_BASE             0x40003000UL
 #define R_CAC_BASE             0x40044600UL
 #define R_CAN0_BASE            0x40050000UL
 #define R_CAN1_BASE            0x40051000UL
 #define R_CRC_BASE             0x40074000UL
 #define R_CTSU_BASE            0x40081000UL
 #define R_DAC_BASE             0x4005E000UL
 #define R_DEBUG_BASE           0x4001B000UL
 #define R_DMA_BASE             0x40005200UL
 #define R_DMAC0_BASE           0x40005000UL
 #define R_DMAC1_BASE           0x40005040UL
 #define R_DMAC2_BASE           0x40005080UL
 #define R_DMAC3_BASE           0x400050C0UL
 #define R_DMAC4_BASE           0x40005100UL
 #define R_DMAC5_BASE           0x40005140UL
 #define R_DMAC6_BASE           0x40005180UL
 #define R_DMAC7_BASE           0x400051C0UL
 #define R_DOC_BASE             0x40054100UL
 #define R_DTC_BASE             0x40005400UL
 #define R_ELC_BASE             0x40041000UL
 #define R_ETHERC0_BASE         0x40064100UL
 #define R_ETHERC_EDMAC_BASE    0x40064000UL
 #define R_FACI_HP_CMD_BASE     0x407E0000UL
 #define R_FACI_HP_BASE         0x407FE000UL
 #define R_FCACHE_BASE          0x4001C000UL
 #define R_GPT0_BASE            0x40078000UL
 #define R_GPT1_BASE            0x40078100UL
 #define R_GPT2_BASE            0x40078200UL
 #define R_GPT3_BASE            0x40078300UL
 #define R_GPT4_BASE            0x40078400UL
 #define R_GPT5_BASE            0x40078500UL
 #define R_GPT6_BASE            0x40078600UL
 #define R_GPT7_BASE            0x40078700UL
 #define R_GPT8_BASE            0x40078800UL
 #define R_GPT9_BASE            0x40078900UL
 #define R_GPT10_BASE           0x40078A00UL
 #define R_GPT11_BASE           0x40078B00UL
 #define R_GPT12_BASE           0x40078C00UL
 #define R_GPT13_BASE           0x40078D00UL
 #define R_GPT_ODC_BASE         0x4007B000UL
 #define R_GPT_OPS_BASE         0x40078FF0UL
 #define R_GPT_POEG0_BASE       0x40042000UL
 #define R_GPT_POEG1_BASE       0x40042100UL
 #define R_GPT_POEG2_BASE       0x40042200UL
 #define R_GPT_POEG3_BASE       0x40042300UL
 #define R_ICU_BASE             0x40006000UL
 #define R_IIC0_BASE            0x40053000UL
 #define R_IIC1_BASE            0x40053100UL
 #define R_IIC2_BASE            0x40053200UL
 #define R_IRDA_BASE            0x40070F00UL
 #define R_IWDT_BASE            0x40044400UL
 #define R_KINT_BASE            0x40080000UL
 #define R_I3C0_BASE            0x40083000UL
 #define R_I3C1_BASE            0x40083400UL
 #define R_MMF_BASE             0x40001000UL
 #define R_MPU_MMPU_BASE        0x40000000UL
 #define R_MPU_SMPU_BASE        0x40000C00UL
 #define R_MPU_SPMON_BASE       0x40000D00UL
 #define R_MSTP_BASE            (0x40047000UL - 4UL) /* MSTPCRA is not located in R_MSTP so the base address must be moved so that MSTPCRB is located at 0x40047000. */
 #define R_PDC_BASE             0x40094000UL
 #define R_PORT0_BASE           0x40040000UL
 #define R_PORT1_BASE           0x40040020UL
 #define R_PORT2_BASE           0x40040040UL
 #define R_PORT3_BASE           0x40040060UL
 #define R_PORT4_BASE           0x40040080UL
 #define R_PORT5_BASE           0x400400A0UL
 #define R_PORT6_BASE           0x400400C0UL
 #define R_PORT7_BASE           0x400400E0UL
 #define R_PORT8_BASE           0x40040100UL
 #define R_PORT9_BASE           0x40040120UL
 #define R_PORT10_BASE          0x40040140UL
 #define R_PORT11_BASE          0x40040160UL
 #define R_PORT12_BASE          0x40040180UL
 #define R_PORT13_BASE          0x400401A0UL
 #define R_PORT14_BASE          0x400401C0UL
 #define R_PFS_BASE             0x40040800UL
 #define R_PMISC_BASE           0x40040D00UL
 #define R_QSPI_BASE            0x64000000UL
 #define R_RTC_BASE             0x40044000UL
 #define R_SCI0_BASE            0x40070000UL
 #define R_SCI1_BASE            0x40070020UL
 #define R_SCI2_BASE            0x40070040UL
 #define R_SCI3_BASE            0x40070060UL
 #define R_SCI4_BASE            0x40070080UL
 #define R_SCI5_BASE            0x400700A0UL
 #define R_SCI6_BASE            0x400700C0UL
 #define R_SCI7_BASE            0x400700E0UL
 #define R_SCI8_BASE            0x40070100UL
 #define R_SCI9_BASE            0x40070120UL
 #define R_SDHI0_BASE           0x40062000UL
 #define R_SDHI1_BASE           0x40062400UL
 #define R_SPI0_BASE            0x40072000UL
 #define R_SPI1_BASE            0x40072100UL
 #define R_SPI2_BASE            0x40072200UL
 #define R_SRAM_BASE            0x40002000UL
 #define R_SRC_BASE             0x40048000UL
 #define R_SSI0_BASE            0x4004E000UL
 #define R_SSI1_BASE            0x4004E100UL
 #define R_SYSTEM_BASE          0x4001E000UL
 #define R_TSN_CAL_BASE         0x407FB17CUL
 #define R_TSN_CTRL_BASE        0x4005D000UL
 #define R_USB_FS0_BASE         0x40090000UL
 #define R_WDT_BASE             0x40044200UL
 #define R_USB_HS0_BASE         0x40060000UL
 #define R_AGTX0_BASE           0x40084000UL
 #define R_AGTX1_BASE           0x40084100UL
 #define R_AGTX2_BASE           0x40084200UL
 #define R_AGTX3_BASE           0x40084300UL
 #define R_AGTX4_BASE           0x40084400UL
 #define R_AGTX5_BASE           0x40084500UL
 #define R_AGTX6_BASE           0x40084600UL
 #define R_AGTX7_BASE           0x40084700UL
 #define R_AGTX8_BASE           0x40084800UL
 #define R_AGTX9_BASE           0x40084900UL
 #define R_WDT1_BASE            0x40044300UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */

/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_declaration
 * @{
 */

 #define R_ACMPHS0         ((R_ACMPHS0_Type *) R_ACMPHS0_BASE)
 #define R_ACMPHS1         ((R_ACMPHS0_Type *) R_ACMPHS1_BASE)
 #define R_ACMPHS2         ((R_ACMPHS0_Type *) R_ACMPHS2_BASE)
 #define R_ACMPHS3         ((R_ACMPHS0_Type *) R_ACMPHS3_BASE)
 #define R_ACMPHS4         ((R_ACMPHS0_Type *) R_ACMPHS4_BASE)
 #define R_ACMPHS5         ((R_ACMPHS0_Type *) R_ACMPHS5_BASE)
 #define R_ADC0            ((R_ADC0_Type *) R_ADC0_BASE)
 #define R_ADC1            ((R_ADC0_Type *) R_ADC1_BASE)
 #define R_BUS             ((R_BUS_Type *) R_BUS_BASE)
 #define R_CAC             ((R_CAC_Type *) R_CAC_BASE)
 #define R_CAN0            ((R_CAN0_Type *) R_CAN0_BASE)
 #define R_CAN1            ((R_CAN0_Type *) R_CAN1_BASE)
 #define R_CRC             ((R_CRC_Type *) R_CRC_BASE)
 #define R_CTSU            ((R_CTSU_Type *) R_CTSU_BASE)
 #define R_DAC             ((R_DAC_Type *) R_DAC_BASE)
 #define R_DEBUG           ((R_DEBUG_Type *) R_DEBUG_BASE)
 #define R_DMA             ((R_DMA_Type *) R_DMA_BASE)
 #define R_DMAC0           ((R_DMAC0_Type *) R_DMAC0_BASE)
 #define R_DMAC1           ((R_DMAC0_Type *) R_DMAC1_BASE)
 #define R_DMAC2           ((R_DMAC0_Type *) R_DMAC2_BASE)
 #define R_DMAC3           ((R_DMAC0_Type *) R_DMAC3_BASE)
 #define R_DMAC4           ((R_DMAC0_Type *) R_DMAC4_BASE)
 #define R_DMAC5           ((R_DMAC0_Type *) R_DMAC5_BASE)
 #define R_DMAC6           ((R_DMAC0_Type *) R_DMAC6_BASE)
 #define R_DMAC7           ((R_DMAC0_Type *) R_DMAC7_BASE)
 #define R_DOC             ((R_DOC_Type *) R_DOC_BASE)
 #define R_DTC             ((R_DTC_Type *) R_DTC_BASE)
 #define R_ELC             ((R_ELC_Type *) R_ELC_BASE)
 #define R_ETHERC0         ((R_ETHERC0_Type *) R_ETHERC0_BASE)
 #define R_ETHERC_EDMAC    ((R_ETHERC_EDMAC_Type *) R_ETHERC_EDMAC_BASE)
 #define R_FACI_HP_CMD     ((R_FACI_HP_CMD_Type *) R_FACI_HP_CMD_BASE)
 #define R_FACI_HP         ((R_FACI_HP_Type *) R_FACI_HP_BASE)
 #define R_FCACHE          ((R_FCACHE_Type *) R_FCACHE_BASE)
 #define R_GPT0            ((R_GPT0_Type *) R_GPT0_BASE)
 #define R_GPT1            ((R_GPT0_Type *) R_GPT1_BASE)
 #define R_GPT2            ((R_GPT0_Type *) R_GPT2_BASE)
 #define R_GPT3            ((R_GPT0_Type *) R_GPT3_BASE)
 #define R_GPT4            ((R_GPT0_Type *) R_GPT4_BASE)
 #define R_GPT5            ((R_GPT0_Type *) R_GPT5_BASE)
 #define R_GPT6            ((R_GPT0_Type *) R_GPT6_BASE)
 #define R_GPT7            ((R_GPT0_Type *) R_GPT7_BASE)
 #define R_GPT8            ((R_GPT0_Type *) R_GPT8_BASE)
 #define R_GPT9            ((R_GPT0_Type *) R_GPT9_BASE)
 #define R_GPT10           ((R_GPT0_Type *) R_GPT10_BASE)
 #define R_GPT11           ((R_GPT0_Type *) R_GPT11_BASE)
 #define R_GPT12           ((R_GPT0_Type *) R_GPT12_BASE)
 #define R_GPT13           ((R_GPT0_Type *) R_GPT13_BASE)
 #define R_GPT_ODC         ((R_GPT_ODC_Type *) R_GPT_ODC_BASE)
 #define R_GPT_OPS         ((R_GPT_OPS_Type *) R_GPT_OPS_BASE)
 #define R_GPT_POEG0       ((R_GPT_POEG0_Type *) R_GPT_POEG0_BASE)
 #define R_GPT_POEG1       ((R_GPT_POEG0_Type *) R_GPT_POEG1_BASE)
 #define R_GPT_POEG2       ((R_GPT_POEG0_Type *) R_GPT_POEG2_BASE)
 #define R_GPT_POEG3       ((R_GPT_POEG0_Type *) R_GPT_POEG3_BASE)
 #define R_ICU             ((R_ICU_Type *) R_ICU_BASE)
 #define R_IIC0            ((R_IIC0_Type *) R_IIC0_BASE)
 #define R_IIC1            ((R_IIC0_Type *) R_IIC1_BASE)
 #define R_IIC2            ((R_IIC0_Type *) R_IIC2_BASE)
 #define R_IRDA            ((R_IRDA_Type *) R_IRDA_BASE)
 #define R_IWDT            ((R_IWDT_Type *) R_IWDT_BASE)
 #define R_KINT            ((R_KINT_Type *) R_KINT_BASE)
 #define R_I3C0            ((R_I3C0_Type *) R_I3C0_BASE)
 #define R_I3C1            ((R_I3C0_Type *) R_I3C1_BASE)
 #define R_MMF             ((R_MMF_Type *) R_MMF_BASE)
 #define R_MPU_MMPU        ((R_MPU_MMPU_Type *) R_MPU_MMPU_BASE)
 #define R_MPU_SMPU        ((R_MPU_SMPU_Type *) R_MPU_SMPU_BASE)
 #define R_MPU_SPMON       ((R_MPU_SPMON_Type *) R_MPU_SPMON_BASE)
 #define R_MSTP            ((R_MSTP_Type *) R_MSTP_BASE)
 #define R_PDC             ((R_PDC_Type *) R_PDC_BASE)
 #define R_PORT0           ((R_PORT0_Type *) R_PORT0_BASE)
 #define R_PORT1           ((R_PORT0_Type *) R_PORT1_BASE)
 #define R_PORT2           ((R_PORT0_Type *) R_PORT2_BASE)
 #define R_PORT3           ((R_PORT0_Type *) R_PORT3_BASE)
 #define R_PORT4           ((R_PORT0_Type *) R_PORT4_BASE)
 #define R_PORT5           ((R_PORT0_Type *) R_PORT5_BASE)
 #define R_PORT6           ((R_PORT0_Type *) R_PORT6_BASE)
 #define R_PORT7           ((R_PORT0_Type *) R_PORT7_BASE)
 #define R_PORT8           ((R_PORT0_Type *) R_PORT8_BASE)
 #define R_PORT9           ((R_PORT0_Type *) R_PORT9_BASE)
 #define R_PORT10          ((R_PORT0_Type *) R_PORT10_BASE)
 #define R_PORT11          ((R_PORT0_Type *) R_PORT11_BASE)
 #define R_PORT12          ((R_PORT0_Type *) R_PORT12_BASE)
 #define R_PORT13          ((R_PORT0_Type *) R_PORT13_BASE)
 #define R_PORT14          ((R_PORT0_Type *) R_PORT14_BASE)
 #define R_PFS             ((R_PFS_Type *) R_PFS_BASE)
 #define R_PMISC           ((R_PMISC_Type *) R_PMISC_BASE)
 #define R_QSPI            ((R_QSPI_Type *) R_QSPI_BASE)
 #define R_RTC             ((R_RTC_Type *) R_RTC_BASE)
 #define R_SCI0            ((R_SCI0_Type *) R_SCI0_BASE)
 #define R_SCI1            ((R_SCI0_Type *) R_SCI1_BASE)
 #define R_SCI2            ((R_SCI0_Type *) R_SCI2_BASE)
 #define R_SCI3            ((R_SCI0_Type *) R_SCI3_BASE)
 #define R_SCI4            ((R_SCI0_Type *) R_SCI4_BASE)
 #define R_SCI5            ((R_SCI0_Type *) R_SCI5_BASE)
 #define R_SCI6            ((R_SCI0_Type *) R_SCI6_BASE)
 #define R_SCI7            ((R_SCI0_Type *) R_SCI7_BASE)
 #define R_SCI8            ((R_SCI0_Type *) R_SCI8_BASE)
 #define R_SCI9            ((R_SCI0_Type *) R_SCI9_BASE)
 #define R_SDHI0           ((R_SDHI0_Type *) R_SDHI0_BASE)
 #define R_SDHI1           ((R_SDHI0_Type *) R_SDHI1_BASE)
 #define R_SPI0            ((R_SPI0_Type *) R_SPI0_BASE)
 #define R_SPI1            ((R_SPI0_Type *) R_SPI1_BASE)
 #define R_SPI2            ((R_SPI0_Type *) R_SPI2_BASE)
 #define R_SRAM            ((R_SRAM_Type *) R_SRAM_BASE)
 #define R_SRC             ((R_SRC_Type *) R_SRC_BASE)
 #define R_SSI0            ((R_SSI0_Type *) R_SSI0_BASE)
 #define R_SSI1            ((R_SSI0_Type *) R_SSI1_BASE)
 #define R_SYSTEM          ((R_SYSTEM_Type *) R_SYSTEM_BASE)
 #define R_TSN_CAL         ((R_TSN_CAL_Type *) R_TSN_CAL_BASE)
 #define R_TSN_CTRL        ((R_TSN_CTRL_Type *) R_TSN_CTRL_BASE)
 #define R_USB_FS0         ((R_USB_FS0_Type *) R_USB_FS0_BASE)
 #define R_WDT             ((R_WDT_Type *) R_WDT_BASE)
 #define R_USB_HS0         ((R_USB_HS0_Type *) R_USB_HS0_BASE)
 #define R_AGT0            ((R_AGTX0_Type *) R_AGTX0_BASE)
 #define R_AGT1            ((R_AGTX0_Type *) R_AGTX1_BASE)
 #define R_AGT2            ((R_AGTX0_Type *) R_AGTX2_BASE)
 #define R_AGT3            ((R_AGTX0_Type *) R_AGTX3_BASE)
 #define R_AGT4            ((R_AGTX0_Type *) R_AGTX4_BASE)
 #define R_AGT5            ((R_AGTX0_Type *) R_AGTX5_BASE)
 #define R_AGT6            ((R_AGTX0_Type *) R_AGTX6_BASE)
 #define R_AGT7            ((R_AGTX0_Type *) R_AGTX7_BASE)
 #define R_AGT8            ((R_AGTX0_Type *) R_AGTX8_BASE)
 #define R_AGT9            ((R_AGTX0_Type *) R_AGTX9_BASE)
 #define R_WDT1            ((R_WDT_Type *) R_WDT1_BASE)

